import { Component } from '@angular/core';

@Component({
  selector: 'app-how-to-use',
  templateUrl: './how-to-use.component.html',
  styleUrls: ['./how-to-use.component.scss']
})
export class HowToUseComponent {
  itemsDetails: any[];

  constructor() {
    this.itemsDetails = [
      {
        title: "قابل الفني الخاص بك",
        description:"سيصل فنينا الودود في الوقت المحدد المجهز بجميع الأدوات واللوازم اللازمة. سوف يحيونك ويبدأون عملية تغيير الزيت."
      },
      {
        title: "دعم العملاء المتميز",
        description: "راجع الخدمة والتاريخ والوقت الذي اخترته. وحدد طريقة الدفع المناسبة إليك بمجرد أن تكون راضيا، قم بتأكيد موعدك لتأمين حجزك."
      },
      {
        title: "زيت وفلاتر عالية الجودة",
        description:"افتح التطبيق وقم بإنشاء حسابك من خلال تقديم المعلومات المطلوبة أو تسجيل الدخول إذا كان لديك بالفعل حساب موجود."
      },
      {
        title: "قم بتحديد نوع الباقة المناسبة",
        description:"قم بزيارة متجر التطبيقات الخاص بك وابحث عن okhtboot قم بتنزيل التطبيق وتثبيته على هاتفك الذكي. إنه متاح لكل من أجهزة iOS وAndroid."
      },
      {
        title: "قم بتأكيد موعدك و طريقة الدفع",
        description: "افتح التطبيق وقم بإنشاء حسابك من خلال تقديم المعلومات المطلوبة أو تسجيل الدخول إذا كان لديك بالفعل حساب موجود."
      },
    ];
  }
}

