import { Component } from '@angular/core';

@Component({
  selector: 'app-terms-and-conditions',
  templateUrl: './terms-and-conditions.component.html',
  styleUrls: ['./terms-and-conditions.component.scss']
})
export class TermsAndConditionsComponent {
  
  terms: any[];

    constructor() {
      this.terms = [

{description:"أنت صيغة المخاطب: العميل المستفيد من خدمات المنصة، وتراعى كافة التعبيرات المؤدية إلى ذلك."},
{description:"العميل: هو كل مستخدم مسجل في المنصة بغرض الاستفادة من أي خدمة مقدمة في المنصة."},
{description:" المستخدم: يقصد بالمستخدم كل من له إمكانية الوصول إلى المنصة والاستفادة منها سواءً كان عميل أو مزود خدمة."},
{description:"نحن صيغة المتحدث: تعني شركة سلاسل الإنشاءات لتقنية المعلومات أو مايمثلها قانونيا."},
{description:": تعني شركة سلاسل الإنشاءات لتقنية المعلومات أو مايمثلها قانونيا."},
{description:"المنصة: تطبيق أو موقع ORO الذي من خلالهما يتمكن العميل من الاستفادة من خدمات ."},
{description:"مزود الخدمة: كل مستخدم مشترك في المنصة لتقديم خدماته وهم: فنيي السيارات."},
{description:" المحتوى: تعني أي مراجعات، تعليقات، رسائل، بيانات، معلومات شخصية، نص، موسيقى، صوت، صورة، إعلان، خدمة، منتج، رسم، فيديو، رابط إلكتروني، رمز أو غيرها من المواد التي يتم مشاركتها أو نشرها أو عرضها على المنصة سواءً كانت من إعداد المنصة أو من إعداد العميل أو مستخدم آخر."},
{description:"الاتفاقية: تعني هذه الاتفاقية -اتفاقية الشروط والأحكام- والتي قد تخضع للتعديل أو التغيير من وقت إلى آخر، والتي تحدد قواعد الاستخدام المشروع للمنصة."},

     
      ];
    }
  }

